Revit 2024 API
BuiltInFailures.CurveFailures.TopLevelBelowBottomLevel Property
 For curveElem support multiple levels, top level belows curve bottom level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TopLevelBelowBottomLevel { get; }
Visual Basic
Public Shared ReadOnly Property TopLevelBelowBottomLevel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TopLevelBelowBottomLevel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace